In [2]:
import pandas as pd

In [3]:
df3=pd.DataFrame(
    {
        'emp_no':[1,2,3,4,5,6,7,8],
        'emp_name':['ravi','kiran','srilu','sanjana','neha','bhavana','basu','subbu'],
        'job':['Developer','Tester','DevOps','Frontend','Backend','Fullstack','Tester','Tester']
        
    }
    
)

In [4]:
df3

   emp_no emp_name        job
0       1     ravi  Developer
1       2    kiran     Tester
2       3    srilu     DevOps
3       4  sanjana   Frontend
4       5     neha    Backend
5       6  bhavana  Fullstack
6       7     basu     Tester
7       8    subbu     Tester

In [6]:
#to get 1st  row data
df3.iloc[0]

emp_no              1
emp_name         ravi
job         Developer
Name: 0, dtype: object

In [7]:
#to get 2nd row,1st column
df3.iloc[1,0]

2

In [8]:
df3.emp_name

0       ravi
1      kiran
2      srilu
3    sanjana
4       neha
5    bhavana
6       basu
7      subbu
Name: emp_name, dtype: object

In [9]:
df3['emp_name'][3]

'sanjana'

In [10]:
df3['job'][2:5]

2      DevOps
3    Frontend
4     Backend
Name: job, dtype: object

In [11]:
df3.iloc[0]

emp_no              1
emp_name         ravi
job         Developer
Name: 0, dtype: object

In [12]:
df3.iloc[1,0]

2

In [13]:
df3.iloc[1:4]

   emp_no emp_name       job
1       2    kiran    Tester
2       3    srilu    DevOps
3       4  sanjana  Frontend

In [15]:
df3.iloc[::1]

   emp_no emp_name        job
0       1     ravi  Developer
1       2    kiran     Tester
2       3    srilu     DevOps
3       4  sanjana   Frontend
4       5     neha    Backend
5       6  bhavana  Fullstack
6       7     basu     Tester
7       8    subbu     Tester

In [16]:
df3.iloc[::2]
#skipping the records

   emp_no emp_name        job
0       1     ravi  Developer
2       3    srilu     DevOps
4       5     neha    Backend
6       7     basu     Tester

In [17]:
df3.iloc[::-1]

   emp_no emp_name        job
7       8    subbu     Tester
6       7     basu     Tester
5       6  bhavana  Fullstack
4       5     neha    Backend
3       4  sanjana   Frontend
2       3    srilu     DevOps
1       2    kiran     Tester
0       1     ravi  Developer

In [18]:
df4=df3.iloc[::-1]

In [19]:
df4

   emp_no emp_name        job
7       8    subbu     Tester
6       7     basu     Tester
5       6  bhavana  Fullstack
4       5     neha    Backend
3       4  sanjana   Frontend
2       3    srilu     DevOps
1       2    kiran     Tester
0       1     ravi  Developer

In [20]:
df4.iloc[:,2]

7       Tester
6       Tester
5    Fullstack
4      Backend
3     Frontend
2       DevOps
1       Tester
0    Developer
Name: job, dtype: object

In [25]:
df4.iloc[[0],[1]]

  emp_name
7    subbu

In [26]:
df4.loc[0,'job']

'Developer'

In [28]:
df4.loc[0,'emp_name']

'ravi'

In [29]:
df4.loc[3,['emp_name','job']]

emp_name     sanjana
job         Frontend
Name: 3, dtype: object

In [30]:
type(df3)

pandas.core.frame.DataFrame

In [38]:
emp_data={
        'emp_no':[1,2,3,4,5,6,7,8],
        'emp_name':['ravi','kiran','srilu','sanjana','neha','bhavana','basu','subbu'],
        'job':['Developer','Tester','DevOps','Frontend','Backend','Fullstack','Tester','Tester']
}

In [40]:
type(emp_data)

dict

In [41]:
df6=pd.DataFrame(emp_data)

In [42]:
df6

   emp_no emp_name        job
0       1     ravi  Developer
1       2    kiran     Tester
2       3    srilu     DevOps
3       4  sanjana   Frontend
4       5     neha    Backend
5       6  bhavana  Fullstack
6       7     basu     Tester
7       8    subbu     Tester

In [43]:
df6.iloc[-1]

emp_no           8
emp_name     subbu
job         Tester
Name: 7, dtype: object

In [44]:
df6.iloc[-1]['job']

'Tester'

In [45]:
df6.iloc[6]['job']

'Tester'

In [46]:
df6.loc[6]['job']

'Tester'

In [48]:
df6.loc[6,'job']

#loc doesn't accept negative numbers

'Tester'

In [49]:
df6.index[-1]

7

In [51]:
df6.loc[df6.index[-1],'job']

'Tester'

In [52]:
df6.loc[df6.index[-2],'job']

'Tester'

In [53]:
#get all employers who are testers

df6['job']

0    Developer
1       Tester
2       DevOps
3     Frontend
4      Backend
5    Fullstack
6       Tester
7       Tester
Name: job, dtype: object

In [54]:
df6['job']=='Tester'

0    False
1     True
2    False
3    False
4    False
5    False
6     True
7     True
Name: job, dtype: bool

In [55]:
df6[df6['job']=='Tester']

   emp_no emp_name     job
1       2    kiran  Tester
6       7     basu  Tester
7       8    subbu  Tester

In [56]:
df6[df6['emp_no']==5]

#emp_no that matches 5

   emp_no emp_name      job
4       5     neha  Backend

In [57]:
df6[df6['emp_no']<5]

#emp_no less than 5

   emp_no emp_name        job
0       1     ravi  Developer
1       2    kiran     Tester
2       3    srilu     DevOps
3       4  sanjana   Frontend

In [59]:
#to get employee info based on the given name

ename=input("Emp name")
df6[df6['emp_name']==ename]

Emp namebasu

   emp_no emp_name     job
6       7     basu  Tester

In [60]:
#to get all testers whose emp_no less than 4

df6[(df6['job']=='Tester') & (df6['emp_no']<4)]

   emp_no emp_name     job
1       2    kiran  Tester

In [61]:
df6['emp_no']

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
Name: emp_no, dtype: int64